<!--Из чего состоит Vue js 
Он состоит из template, div, script и style
В template должен быть обязательно один корневой элемент как div включительно у корневого элемента должен быть свой класс 



что касается script то это часть где вводится вся логика плюс то что он состоит из отдельных частей как:



style часть где разрабатывается все стили страницы. 
Стили вводятся через классы как пример class="main" то в style будет .main{} В таком ключе и вводится стиль внутри main{} 
если нужно добавить стиль только в один из элементов класса пример class="main" <h2>Privet</h2> то в таком случае стиль вводится так .main h2{}.-->

<template >
    <div>
        
    </div>
</template>
<script>
export default {
    
}
</script>
<style >
    
</style>